app/Http/Controllers/NewsController.php

    public function index(Request $request)
    {
        $posts = News::all()->sortByDesc('updated_at');
---
select * from `news`