app/Http/Controllers/ProfileController.php

select * from `profiles`
---
    public function index(Request $request)
    {
        $posts = Profiles::all()->sortByDesc('updated_at');