app/Http/Controllers/Admin/NewsController.php

  public function create(Request $request)
  {
     // Varidationを行う
      $this->validate($request, News::$rules);

      $news = new News;
      $form = $request->all();

       // formに画像があれば、保存する
      if ($form['image']) {
        $path = $request->file('image')->store('public/image');
        $news->image_path = basename($path);
      } else {
          $news->image_path = null;
      }

      unset($form['_token']);
      unset($form['image']);
      // データベースに保存する
      $news->fill($form);
      $news->save();
---
insert into `news` (`image_path`, `title`, `body`, `updated_at`, `created_at`) values ('1Ia9mHGfMrFESAH52OGhOZdw81aJwFLDP5tM8VP2.png', 'title', 'body', '2020-08-01 11:50:32', '2020-08-01 11:50:32')

      public function index(Request $request)
  {
      $cond_title = $request->cond_title;
      if ($cond_title != '') {
          $posts = News::where('title', $cond_title)->get();
      } else {
          $posts = News::all();
---
select * from `news`

      public function update(Request $request)
  {
      // Validationをかける
      $this->validate($request, News::$rules);
      // News Modelからデータを取得する
      $news = News::find($request->id);
      // 送信されてきたフォームデータを格納する
      $news_form = $request->all();
      if (isset($news_form['image'])) {
        $path = $request->file('image')->store('public/image');
        $news->image_path = basename($path);
        unset($news_form['image']);
      } elseif (isset($request->remove)) {
        $news->image_path = null;
        unset($news_form['remove']);
      }
      unset($news_form['_token']);
      // 該当するデータを上書きして保存する
      $news->fill($news_form)->save();

      $history = new History;
      $history->news_id = $news->id;
      $history->edited_at = Carbon::now();
      $history->save();
---
insert into `histories` (`news_id`, `edited_at`, `updated_at`, `created_at`) values (1, '2020-07-27 07:08:19', '2020-07-27 07:08:19', '2020-07-27 07:08:19')