app/Http/Controllers/Admin/ProfileController.php

    public function create(Request $request)
    {
        $this->validate($request, Profiles::$rules);

        $profiles = new Profiles;
        $form = $request->all();
        $profiles->fill($form);
        $profiles->save();
---
insert into `profiles` (`name`, `gender`, `hobby`, `introduction`, `updated_at`, `created_at`) values ('d', 'd', 'd', 'd', '2020-07-27 07:11:57', '2020-07-27 07:11:57')

public function edit(Request $request , Profiles $profiles)
{
    $profiles_form = Profiles::find($request->id);
    $history = Profile_History::where('profiles_id', $request->id)->get()->toArray();
---
select * from `profile_histories` where `profiles_id` = '8' limit 1

    public function update(Request $request)
    {
        $this->validate($request, Profiles::$rules);

        $profiles = Profiles::find($request->id);

        $profiles_form = $request->all();

        $profiles->fill($profiles_form)->save();

        $profile_history = new Profile_History;
        $profile_history->profiles_id = $profiles->id;
        $profile_history->edited_at = Carbon::now();
        $profile_history->save();
---
update `profiles` set `gender` = 'adddd', `hobby` = 'adaa', `introduction` = 'addddddxxxxx', `profiles`.`updated_at` = '2020-07-28 06:19:30' where `id` = 9
insert into `profile_histories` (`profiles_id`, `edited_at`, `updated_at`, `created_at`) values (9, '2020-07-28 06:19:30', '2020-07-28 06:19:30', '2020-07-28 06:19:30')

    public function index(Request $request)
  {
      $cond_title = $request->cond_title;
      if ($cond_title != '') {
          $posts = Profiles::where('title', $cond_title)->get();
      } else {
          $posts = Profiles::all();
---
select * from `profiles`

        public function delete(Request $request)
  {
      $profiles = Profiles::find($request->id);
      // 削除する
      $profiles->delete();
---
delete from `profiles` where `id` = 10